// 1. Виведіть парні числа від 2 до 20

for (let i = 0; i <= 20; i++) {
    if (i % 2 == 0 && i != 0) {
        console.log(i)
    }
}

// 2. Запитуйте у користувача з допомогою prompt число, доки він не введе число більше 100.

let num

do {
    num = +prompt('Give us some number that more than 100', '0')
} while (num < 100)


// 3. Виведіть числа Фібоначчі менші за 100



// 1.  Знайдіть суму всіх цифр від 1 до 100.

// 2.  Є масив [1, 2, 3, 4, 5]. З допомогою  цикла for вивести всі елементи на екран.

// 3. Є масив [-1, 22, 3, 44, 5]. Виведіть максимальне значення

// 4. Попросити юзера ввести 8 чисел і скільки він ввів додатніх, відємних та нулів. Вивести статистику на екран. Також досмтатньо тільки 1 змінної для отримання даних від юзера. 

// 5. Надрукуйте табличку множення для числа  8 від 1 до 9. 8 х 1 = 8

// 6. Є масив з елементами 2, 5, 9, 15, 0, 4. З допомогою цикла for і оператора if вивести на екран цифри, які більше 3-х, але менше 10.

// 7. Створити калькулятор який буде зациклений. Запитати у юзера 2 числа та знак , провести математичну операцію, далі вивести результат і спитатись чи хоче юзер повторити?